<html><head><title>&#1579;&#1594;&#1575;&#1585;&#1575;&#1578; XSS </title><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}.c7{max-width:468pt;background-color:#ffffff;padding:72pt 72pt 72pt 72pt}.c1{font-size:24pt;font-weight:bold}.c4{color:#1155cc;text-decoration:underline}.c6{color:inherit;text-decoration:inherit}.c2{height:11pt}.c3{font-size:14pt}.c0{direction:rtl}.c5{text-align:right}.title{padding-top:0pt;line-height:1.15;text-align:left;color:#000000;font-size:21pt;font-family:"Trebuchet MS";padding-bottom:0pt}.subtitle{padding-top:0pt;line-height:1.15;text-align:left;color:#666666;font-style:italic;font-size:13pt;font-family:"Trebuchet MS";padding-bottom:10pt}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{padding-top:10pt;line-height:1.15;text-align:left;color:#000000;font-size:16pt;font-family:"Trebuchet MS";padding-bottom:0pt}h2{padding-top:10pt;line-height:1.15;text-align:left;color:#000000;font-size:13pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt}h3{padding-top:8pt;line-height:1.15;text-align:left;color:#666666;font-size:12pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt}h4{padding-top:8pt;line-height:1.15;text-align:left;color:#666666;font-size:11pt;text-decoration:underline;font-family:"Trebuchet MS";padding-bottom:0pt}h5{padding-top:8pt;line-height:1.15;text-align:left;color:#666666;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt}h6{padding-top:8pt;line-height:1.15;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt}</style></head><body class="c7"><p class="c0"><span class="c1">&#1605;&#1575;&#1607;&#1610; &#1579;&#1594;&#1585;&#1575;&#1578; XSS &#1567;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; Cross Site Scripting &#1575;&#1608; &#1605;&#1575; &#1610;&#1615;&#1582;&#1578;&#1589;&#1585; &#1576;&#1600; XSS &#1607;&#1610; &#1579;&#1594;&#1585;&#1575;&#1578; &#1571;&#1605;&#1606;&#1610;&#1577; &#1605;&#1606;&#1578;&#1588;&#1585;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1589;&#1593;&#1610;&#1583; &#1575;&#1604;&#1608;&#1575;&#1587;&#1593; &#1601;&#1610; &#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1608;&#1610;&#1576;. &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1579;&#1594;&#1585;&#1575;&#1578; &#1610;&#1602;&#1608;&#1605; &#1588;&#1582;&#1589; (&#1575;&#1604;&#1605;&#1607;&#1575;&#1580;&#1605;) &#1576;&#1581;&#1602;&#1606; &#1603;&#1608;&#1583; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1582;&#1576;&#1610;&#1579; &#1593;&#1575;&#1583;&#1577; &#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1576;&#1604;&#1594;&#1577; &#1575;&#1604;&#1587;&#1585;&#1603;&#1578;&#1576; JavaScript &#1575;&#1604;&#1578;&#1610; &#1610;&#1602;&#1608;&#1605; &#1575;&#1604;&#1605;&#1578;&#1589;&#1601;&#1581; &#1576;&#1578;&#1606;&#1601;&#1610;&#1583; &#1575;&#1608;&#1575;&#1605;&#1585; &#1575;&#1604;&#1603;&#1608;&#1583; &#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1578;&#1605; &#1578;&#1581;&#1605;&#1610;&#1604; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1593;&#1606;&#1583; &#1575;&#1604;&#1588;&#1582;&#1589; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; (&#1575;&#1604;&#1590;&#1581;&#1610;&#1577;).</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1610;&#1578;&#1605; &#1581;&#1602;&#1606; &#1575;&#1604;&#1603;&#1608;&#1583; &#1605;&#1606; &#1602;&#1576;&#1604; &#1575;&#1604;&#1588;&#1582;&#1589; &#1575;&#1604;&#1605;&#1607;&#1575;&#1580;&#1605; &#1576;&#1591;&#1585;&#1602; &#1593;&#1583;&#1577; &#1605;&#1606;&#1607;&#1575;: &#1608;&#1607;&#1605; &#1575;&#1604;&#1590;&#1581;&#1610;&#1577; &#1604;&#1604;&#1592;&#1594;&#1591; &#1593;&#1604;&#1609; &#1585;&#1575;&#1576;&#1591; (XSS &#1605;&#1606;&#1593;&#1603;&#1587;)&#1548; &#1575;&#1608; &#1575;&#1606;&#1578;&#1592;&#1575;&#1585; &#1575;&#1604;&#1590;&#1581;&#1610;&#1577; &#1604;&#1610;&#1578;&#1589;&#1601;&#1581; &#1589;&#1601;&#1581;&#1577; &#1601;&#1610; &#1575;&#1604;&#1605;&#1608;&#1602;&#1593; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1578;&#1608;&#1610; &#1593;&#1604;&#1609; &#1579;&#1594;&#1585;&#1577; &#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1608;&#1593; (XSS &#1605;&#1582;&#1586;&#1606;).</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c1">&#1603;&#1610;&#1601; &#1610;&#1578;&#1605; &#1573;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600;XSS &#1601;&#1610; &#1593;&#1605;&#1604;&#1610;&#1575;&#1578; &#1575;&#1604;&#1573;&#1582;&#1578;&#1585;&#1575;&#1602; &#1605;&#1606; &#1602;&#1576;&#1604; &#1575;&#1604;&#1602;&#1585;&#1575;&#1589;&#1606;&#1577; &#1567;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1573;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600;XSS &#1610;&#1587;&#1578;&#1593;&#1591;&#1610;&#1593; &#1575;&#1604;&#1602;&#1585;&#1575;&#1589;&#1606;&#1577; &#1587;&#1585;&#1602;&#1577; &#1605;&#1575; &#1610;&#1587;&#1605;&#1609; &#1576;&#1575;&#1604;&#1600;Cookies &#1608;&#1576;&#1584;&#1604;&#1603; &#1610;&#1587;&#1578;&#1591;&#1610;&#1593;&#1608;&#1606; &#1578;&#1602;&#1606;&#1589; &#1588;&#1582;&#1589;&#1610;&#1578;&#1603; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1578;&#1608;&#1610; &#1593;&#1604;&#1609; &#1579;&#1594;&#1585;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1610;&#1587;&#1578;&#1591;&#1593; &#1575;&#1604;&#1602;&#1585;&#1575;&#1589;&#1606;&#1577; &#1571;&#1610;&#1590;&#1575; &#1575;&#1606; &#1610;&#1581;&#1608;&#1604;&#1608;&#1575; &#1605;&#1578;&#1589;&#1601;&#1581;&#1603; &#1604;&#1589;&#1601;&#1581;&#1577; &#1605;&#1604;&#1594;&#1608;&#1605;&#1577; &#1578;&#1581;&#1578;&#1608;&#1610; &#1593;&#1604;&#1609; &#1576;&#1585;&#1575;&#1605;&#1580; &#1582;&#1576;&#1610;&#1579;&#1577; &#1605;&#1579;&#1604; &#1575;&#1604;&#1601;&#1610;&#1585;&#1608;&#1587;&#1575;&#1578; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575;.</span></p><p class="c0"><span class="c3">&nbsp;&#1608;&#1610;&#1587;&#1578;&#1591;&#1610;&#1593;&#1608;&#1575;&#1606; &#1603;&#1584;&#1604;&#1603; &#1578;&#1581;&#1608;&#1610;&#1604; &#1605;&#1578;&#1589;&#1601;&#1581;&#1603; &#1575;&#1604;&#1609; &#1589;&#1601;&#1581;&#1577; &#1605;&#1588;&#1575;&#1576;&#1607;&#1577; &#1578;&#1605;&#1575;&#1605;&#1575; &#1604;&#1589;&#1601;&#1581;&#1577; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1575;&#1604;&#1584;&#1610; &#1578;&#1586;&#1608;&#1585;&#1607; (&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1575;&#1583;&#1575;&#1593;&#1575;&#1578; &#1575;&#1604;&#1576;&#1606;&#1603; &#1605;&#1579;&#1604;&#1575;) &#1608;&#1610;&#1602;&#1608;&#1605;&#1608;&#1606; &#1576;&#1587;&#1585;&#1602;&#1577; &#1603;&#1604;&#1605;&#1575;&#1578; &#1575;&#1604;&#1587;&#1585; &#1575;&#1604;&#1582;&#1575;&#1589;&#1577; &#1576;&#1603;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1610;&#1578;&#1605; &#1571;&#1610;&#1590;&#1575; &#1573;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1579;&#1594;&#1585;&#1575;&#1578; &#1604;&#1610;&#1578;&#1605; &#1578;&#1582;&#1591;&#1610; &nbsp;&#1575;&#1604;&#1581;&#1605;&#1575;&#1610;&#1577; &#1601;&#1610; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1575;&#1608; &#1605;&#1578;&#1589;&#1601;&#1581;&#1603; &#1575;&#1604;&#1584;&#1610; &#1578;&#1578;&#1589;&#1601;&#1581; &#1576;&#1607; &#1575;&#1604;&#1608;&#1610;&#1576;.</span></p><p class="c0"><span class="c3">&#1607;&#1584;&#1607; &#1601;&#1602;&#1591; &#1576;&#1593;&#1590; &#1605;&#1606; &#1575;&#1604;&#1607;&#1580;&#1605;&#1575;&#1578; &#1608;&#1604;&#1610;&#1587; &#1603;&#1604;&#1607;&#1575;. &#1604;&#1575; &#1610;&#1608;&#1580;&#1583; &#1581;&#1583; &#1605;&#1593;&#1610;&#1606; &#1604;&#1603;&#1610;&#1601;&#1610;&#1577; &#1573;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1575;&#1578; XSS &#1601;&#1584;&#1604;&#1603; &#1610;&#1593;&#1578;&#1605;&#1583; &#1593;&#1604;&#1609; &#1582;&#1610;&#1575;&#1604; &#1575;&#1604;&#1605;&#1607;&#1575;&#1580;&#1605; &#1608;&#1581;&#1585;&#1601;&#1610;&#1578;&#1607; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1580;&#1575;&#1604;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1607;&#1604; &#1610;&#1587;&#1578;&#1591;&#1610;&#1593;&#1608;&#1606; &#1602;&#1585;&#1589;&#1606;&#1577; &#1580;&#1607;&#1575;&#1586;&#1603; &#1608;&#1605;&#1588;&#1575;&#1607;&#1583;&#1577; &#1575;&#1604;&#1603;&#1605;&#1585;&#1577; &#1575;&#1604;&#1582;&#1575;&#1589;&#1577;&#1567; - &#1606;&#1593;&#1605; ! &#1607;&#1604; &#1610;&#1587;&#1578;&#1591;&#1610;&#1593;&#1608;&#1606; &#1575;&#1604;&#1573;&#1587;&#1578;&#1605;&#1575;&#1593; &#1604;&#1604;&#1605;&#1610;&#1603;&#1585;&#1608;&#1601;&#1608;&#1606;&#1567; - &#1591;&#1576;&#1593;&#1575;!</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c4 c3"><a class="c6" href="http://beefproject.com/">&#1604;&#1604;&#1578;&#1593;&#1585;&#1601; &#1593;&#1604;&#1609; &#1576;&#1602;&#1610;&#1577; &#1575;&#1604;&#1607;&#1580;&#1575;&#1605;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1602;&#1583;&#1605;&#1577; - &#1602;&#1605; &#1576;&#1586;&#1610;&#1575;&#1585;&#1577; &#1589;&#1601;&#1581;&#1577; &#1605;&#1588;&#1585;&#1608;&#1593; BeEF</a></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c1">&#1605;&#1606; &#1578;&#1605; &#1573;&#1582;&#1578;&#1575;&#1585;&#1602;&#1607; &#1576;&#1587;&#1576;&#1576; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1567;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1601;&#1610; &#1587;&#1606;&#1577; 2010 &#1578;&#1605; </span><span class="c4 c3"><a class="c6" href="https://blogs.apache.org/infra/entry/apache_org_04_09_2010">&#1573;&#1582;&#1578;&#1585;&#1575;&#1602; &#1603;&#1575;&#1605;&#1604; &#1604;&#1605;&#1572;&#1587;&#1587;&#1577; &#1571;&#1576;&#1575;&#1578;&#1588;&#1610;</a></span><span class="c3">&nbsp;&#1575;&#1604;&#1594;&#1606;&#1610;&#1577; &#1593;&#1606; &#1575;&#1604;&#1578;&#1593;&#1585;&#1610;&#1601; &#1575;&#1604;&#1578;&#1610; &#1578;&#1602;&#1608;&#1605; &#1576;&#1578;&#1591;&#1608;&#1610;&#1585; &#1582;&#1575;&#1583;&#1605; &#1575;&#1604;&#1608;&#1610;&#1576; &#1575;&#1604;&#1588;&#1607;&#1610;&#1585; Apache Web Server &#1608;&#1584;&#1604;&#1603; &#1603;&#1604;&#1607; &#1603;&#1575;&#1606; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1577; XSS &#1589;&#1594;&#1610;&#1585;&#1577; &#1601;&#1610; &#1605;&#1608;&#1602;&#1593; &#1575;&#1604;&#1605;&#1572;&#1587;&#1587;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1579;&#1594;&#1585;&#1577; &#1605;&#1606; &#1606;&#1601;&#1587; &#1575;&#1604;&#1606;&#1608;&#1593; &#1601;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1575;&#1604;&#1605;&#1606;&#1578;&#1583;&#1610;&#1575;&#1578; &#1575;&#1604;&#1582;&#1575;&#1589; &#1576;&#1605;&#1608;&#1602;&#1593; &#1578;&#1608;&#1586;&#1610;&#1593;&#1577; Ubunto &#1575;&#1604;&#1605;&#1588;&#1607;&#1608;&#1585;&#1577; &#1571;&#1583;&#1578; &#1575;&#1610;&#1590;&#1575;</span><span class="c4 c3"><a class="c6" href="http://www.scmagazineuk.com/ubuntu-forums-back-online-after-attack-analysis-reveals-xss-tactic/article/305321/">&nbsp;&#1604;&#1587;&#1585;&#1602;&#1577; &#1571;&#1603;&#1579;&#1585; &#1605;&#1606; 1.8 &#1605;&#1604;&#1610;&#1608;&#1606; &#1575;&#1610;&#1605;&#1610;&#1604; &#1608;&#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1587;&#1585; &#1575;&#1604;&#1582;&#1575;&#1589;&#1577; &#1576;&#1607;</a></span><span class="c3">!</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1607;&#1584;&#1607; &#1575;&#1604;&#1594;&#1585;&#1575;&#1578; &#1593;&#1575;&#1583;&#1577; &#1605;&#1575; &#1578;&#1587;&#1578;&#1607;&#1583;&#1601; &#1605;&#1587;&#1578;&#1582;&#1583;&#1605;&#1610; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1608;&#1575;&#1604;&#1588;&#1576;&#1603;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1610;&#1578;&#1589;&#1604;&#1608;&#1606; &#1576;&#1607;&#1575;. &#1608;&#1604;&#1603;&#1606; &#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1578;&#1608;&#1602;&#1601; &#1575;&#1604;&#1571;&#1605;&#1585; &#1593;&#1604;&#1609; &#1605;&#1587;&#1578;&#1582;&#1583;&#1605; &#1604;&#1607; (&#1604;&#1607;&#1575;) &#1589;&#1604;&#1575;&#1581;&#1610;&#1575;&#1577; &#1575;&#1604;&#1605;&#1583;&#1610;&#1585; &#1575;&#1604;&#1593;&#1575;&#1605; &#1604;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1578;&#1603;&#1608;&#1606; &#1575;&#1604;&#1606;&#1578;&#1610;&#1580;&#1577; &#1603;&#1575;&#1585;&#1579;&#1610;&#1577; &#1608;&#1610;&#1578;&#1605; &#1575;&#1604;&#1608;&#1589;&#1608;&#1604; &#1604;&#1582;&#1575;&#1583;&#1605; &#1575;&#1604;&#1608;&#1610;&#1576; &#1603;&#1604;&#1607; &#1576;&#1583;&#1604;&#1575; &#1605;&#1606; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1601;&#1602;&#1591;!</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1578;&#1606;&#1578;&#1588;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1579;&#1594;&#1585;&#1575;&#1578; &#1593;&#1604;&#1609; &#1593;&#1583;&#1577; &#1605;&#1606;&#1589;&#1575;&#1578; &#1605;&#1606;&#1607;&#1575; Twitter, Facebook, Google, Yahoo.. &#1608;&#1610;&#1578;&#1605; &#1575;&#1603;&#1578;&#1588;&#1575;&#1601;&#1607;&#1575; &#1605;&#1576;&#1603;&#1585;&#1575; &#1593;&#1606; &#1591;&#1585;&#1610;&#1602; &#1581;&#1605;&#1604;&#1575;&#1578; &#1604;&#1578;&#1588;&#1580;&#1610;&#1593; &#1575;&#1603;&#1578;&#1588;&#1575;&#1601; &#1607;&#1584;&#1607; &#1575;&#1604;&#1579;&#1594;&#1585;&#1575;&#1578; &#1578;&#1587;&#1605;&#1609; </span><span class="c4 c3"><a class="c6" href="https://bugcrowd.com/list-of-bug-bounty-programs/">Bug Bounties</a></span><span class="c3">&nbsp;&#1581;&#1610;&#1579; &#1610;&#1578;&#1605; &#1583;&#1601;&#1593; &#1602;&#1610;&#1605;&#1577; &#1605;&#1575;&#1604;&#1610;&#1577; &#1608;&#1575;&#1604;&#1578;&#1588;&#1607;&#1610;&#1585; &#1576;&#1605;&#1606; &#1575;&#1603;&#1578;&#1588;&#1601; &#1575;&#1604;&#1579;&#1594;&#1585;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1601;&#1610; &#1607;&#1584;&#1575; </span><span class="c4 c3"><a class="c6" href="https://www.google.com/fusiontables/DataSource?snapid=S1158702BBoV">&#1575;&#1604;&#1585;&#1575;&#1576;&#1591;</a></span><span class="c3">&nbsp;&#1575;&#1604;&#1593;&#1583;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1607;&#1580;&#1605;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1576;&#1583;&#1571;&#1578; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1577; XSS &#1576;&#1587;&#1610;&#1591;&#1577; &#1601;&#1610; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c1">&#1603;&#1610;&#1601; &#1571;&#1581;&#1605;&#1610; &#1606;&#1601;&#1587;&#1610; &#1605;&#1606; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1567;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1578;&#1571;&#1603;&#1583; &#1605;&#1606; &#1575;&#1606;&#1603; &#1578;&#1587;&#1578;&#1582;&#1583;&#1605; &#1570;&#1582;&#1585; &#1578;&#1581;&#1583;&#1610;&#1579; &#1605;&#1606; &#1605;&#1578;&#1589;&#1601;&#1581; &#1575;&#1604;&#1573;&#1606;&#1578;&#1585;&#1606;&#1578; &#1605;&#1593; &#1578;&#1601;&#1593;&#1610;&#1604; &#1603;&#1575;&#1601;&#1577; &#1582;&#1610;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1581;&#1605;&#1575;&#1610;&#1577; &#1575;&#1604;&#1605;&#1578;&#1593;&#1604;&#1602;&#1577; &#1576;&#1607; &#1605;&#1579;&#1604; XSS Filter &#1608;&#1594;&#1610;&#1585;&#1607;&#1575;. &#1575;&#1584;&#1575; &#1603;&#1606;&#1578; &#1578;&#1587;&#1578;&#1582;&#1583;&#1605; &#1605;&#1578;&#1589;&#1601;&#1581; &#1604;&#1575; &#1610;&#1583;&#1593;&#1605; &#1582;&#1610;&#1575;&#1585; &#1605;&#1579;&#1604; &#1607;&#1584;&#1575; (FireFox) &#1601;&#1610;&#1615;&#1606;&#1589;&#1581; &#1576;&#1573;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; &#1575;&#1590;&#1575;&#1601;&#1577; </span><span class="c4 c3"><a class="c6" href="https://addons.mozilla.org/en-US/firefox/addon/noscript/">NoScript</a></span><span class="c3">&nbsp;&#1575;&#1604;&#1578;&#1610; &#1578;&#1593;&#1605;&#1604; &#1603;&#1581;&#1605;&#1575;&#1610;&#1577; &#1601;&#1593;&#1575;&#1604;&#1577; &#1590;&#1583; &#1607;&#1580;&#1605;&#1575;&#1578; &#1605;&#1606; &#1606;&#1608;&#1593; XSS.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1603;&#1606; &#1581;&#1584;&#1585;&#1575; &#1580;&#1583;&#1575; &#1593;&#1606;&#1583;&#1605;&#1575; &#1578;&#1592;&#1594;&#1591; &#1593;&#1604;&#1609; &#1585;&#1575;&#1576;&#1591; &#1605;&#1593;&#1610;&#1606;. &#1576;&#1593;&#1590; &#1575;&#1604;&#1585;&#1608;&#1575;&#1576;&#1591; &#1604;&#1575; &#1578;&#1576;&#1583;&#1608;&#1575; &#1582;&#1591;&#1610;&#1585;&#1577; &#1605;&#1576;&#1583;&#1574;&#1610;&#1575; &#1604;&#1603;&#1606;&#1607;&#1575; &#1578;&#1581;&#1578;&#1608;&#1610; &#1593;&#1604;&#1609; &#1603;&#1608;&#1583; &#1582;&#1576;&#1610;&#1579; &#1575;&#1608; &#1594;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1604;&#1579;&#1594;&#1585;&#1577; XSS.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1602;&#1605; &#1583;&#1575;&#1574;&#1605;&#1575; &#1576;&#1578;&#1587;&#1580;&#1610;&#1604; &#1582;&#1585;&#1608;&#1580;&#1603; &#1576;&#1593;&#1583; &#1575;&#1606; &#1578;&#1606;&#1578;&#1607;&#1610; &#1605;&#1606; &#1575;&#1604;&#1593;&#1605;&#1604; &#1593;&#1604;&#1609; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1608;&#1610;&#1576; &#1605;&#1593;&#1610;&#1606; (Sign Out</span><span class="c3">).</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c1">&#1571;&#1606;&#1575; &#1605;&#1576;&#1585;&#1605;&#1580; &#1548; &#1603;&#1610;&#1601; &#1571;&#1581;&#1605;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580;&#1610; &#1605;&#1606; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1567;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1610;&#1578;&#1605; &#1573;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1575;&#1578; XSS &#1593;&#1606;&#1583;&#1605;&#1575; &#1604;&#1575; &#1610;&#1578;&#1605; &#1601;&#1581;&#1589; &#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1576;&#1593;&#1606;&#1575;&#1610;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1593;&#1604;&#1609; &#1587;&#1576;&#1610;&#1604; &#1575;&#1604;&#1605;&#1579;&#1575;&#1604; &#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1602;&#1608;&#1605; &#1575;&#1604;&#1605;&#1587;&#1578;&#1582;&#1583;&#1605; &#1576;&#1603;&#1578;&#1575;&#1576;&#1577; &#1573;&#1587;&#1605;&#1607; (&#1573;&#1587;&#1605;&#1607;&#1575;) &#1601;&#1610; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1579;&#1605; &#1610;&#1602;&#1608;&#1605; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1576;&#1573;&#1592;&#1607;&#1575;&#1585; &#1575;&#1604;&#1573;&#1587;&#1605; &#1576;&#1583;&#1608;&#1606; &#1601;&#1581;&#1589; &#1601;&#1605;&#1575;&#1584;&#1575; &#1587;&#1610;&#1581;&#1583;&#1579; &#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1578;&#1605; &#1573;&#1583;&#1582;&#1575;&#1604; &#1573;&#1587;&#1605; &#1605;&#1587;&#1578;&#1582;&#1583;&#1605; &#1576;&#1604;&#1594;&#1577; &#1576;&#1585;&#1605;&#1580;&#1577; HTML &#1605;&#1579;&#1604;&#1575;&#1567; &#1604;&#1606; &#1610;&#1612;&#1601;&#1585;&#1602; &#1575;&#1604;&#1605;&#1578;&#1589;&#1601;&#1581; &#1576;&#1610;&#1606; &#1573;&#1587;&#1605; &#1575;&#1604;&#1605;&#1587;&#1578;&#1582;&#1583;&#1605; &#1608;&#1576;&#1602;&#1610;&#1577; &#1603;&#1608;&#1583; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1608;&#1587;&#1610;&#1578;&#1593;&#1575;&#1605;&#1604; &#1605;&#1593;&#1607; &#1593;&#1604;&#1609; &#1575;&#1606;&#1607; &#1603;&#1608;&#1583; &#1601;&#1610; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1605;&#1579;&#1604;&#1607; &#1605;&#1579;&#1604; &#1576;&#1575;&#1602;&#1610; &#1575;&#1604;&#1587;&#1591;&#1608;&#1585;&#1548; &#1571;&#1610; &#1575;&#1606;&#1607; &#1587;&#1610;&#1578;&#1605; &#1578;&#1606;&#1601;&#1610;&#1584; &#1575;&#1604;&#1571;&#1608;&#1575;&#1605;&#1585; &#1575;&#1604;&#1578;&#1610; &#1571;&#1583;&#1582;&#1604;&#1607;&#1575; &#1575;&#1604;&#1605;&#1587;&#1578;&#1582;&#1583;&#1605; &#1576;&#1583;&#1608;&#1606; &#1575;&#1610; &#1605;&#1588;&#1603;&#1604;&#1577;!</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1602;&#1605; &#1576;&#1601;&#1581;&#1589; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1601;&#1610; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580;&#1548; &#1608;&#1584;&#1604;&#1603; &#1576;&#1578;&#1591;&#1607;&#1610;&#1585; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1605;&#1606; &#1575;&#1610; &#1603;&#1608;&#1583; &#1582;&#1576;&#1610;&#1579; &#1575;&#1608; &#1605;&#1581;&#1575;&#1608;&#1604;&#1577; &#1604;&#1581;&#1602;&#1606; &#1603;&#1608;&#1583; &#1601;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578;. &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1606;&#1608;&#1593; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1571;&#1585;&#1602;&#1575;&#1605;&#1575; &#1601;&#1602;&#1591; &#1601;&#1604;&#1575; &#1578;&#1602;&#1605; &#1576;&#1575;&#1604;&#1587;&#1605;&#1575;&#1581; &#1604;&#1604;&#1581;&#1585;&#1608;&#1601; &#1576;&#1575;&#1604;&#1605;&#1585;&#1608;&#1585; &#1593;&#1576;&#1585; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580;. &nbsp;&#1573;&#1587;&#1578;&#1582;&#1583;&#1605; &#1575;&#1604;&#1602;&#1608;&#1575;&#1574;&#1605; &#1575;&#1604;&#1576;&#1610;&#1590;&#1575;&#1569; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1610; &#1575;&#1606;&#1607; &#1610;&#1578;&#1605; &#1605;&#1602;&#1575;&#1585;&#1606;&#1577; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1576;&#1602;&#1575;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1575;&#1604;&#1605;&#1587;&#1605;&#1608;&#1581;&#1577; &#1601;&#1602;&#1591; &#1608;&#1610;&#1578;&#1605; &#1585;&#1601;&#1590; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1578;&#1603;&#1608;&#1606; &#1601;&#1610; &#1578;&#1604;&#1603; &#1575;&#1604;&#1602;&#1575;&#1574;&#1605;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1578;&#1571;&#1603;&#1583; &#1576;&#1571;&#1606; &#1578;&#1585;&#1605;&#1610;&#1586; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1601;&#1610; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1578;&#1591;&#1604;&#1576;&#1607; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; (Character Encoding). &#1601;&#1610; &#1581;&#1575;&#1604;&#1577; &#1575;&#1604;&#1578;&#1585;&#1605;&#1610;&#1586; &#1589;&#1581;&#1610;&#1581; &#1587;&#1610;&#1578;&#1593;&#1585;&#1601; &#1575;&#1604;&#1605;&#1578;&#1589;&#1601;&#1581; &#1605;&#1575; &#1575;&#1584;&#1575; &#1603;&#1575;&#1606;&#1578; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1575;&#1604;&#1578;&#1610; &#1610;&#1578;&#1605; &#1593;&#1585;&#1590;&#1607;&#1575; &#1610;&#1585;&#1605;&#1586; &#1575;&#1604;&#1610;&#1607;&#1575; &#1576;&#1588;&#1603;&#1604; &#1605;&#1593;&#1610;&#1606; &#1575;&#1608; &#1604;&#1575;. &#1571;&#1610; &#1575;&#1606;&#1603; &#1604;&#1606; &#1578;&#1583;&#1593; &#1604;&#1604;&#1605;&#1589;&#1601;&#1581; &#1575;&#1604;&#1573;&#1582;&#1578;&#1610;&#1575;&#1585; &#1575;&#1584; &#1575;&#1606;&#1607; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1581;&#1575;&#1604;&#1575;&#1578; &#1610;&#1578;&#1605; &#1573;&#1587;&#1594;&#1604;&#1575;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1582;&#1575;&#1589;&#1610;&#1577; &#1601;&#1610; &#1575;&#1604;&#1605;&#1578;&#1589;&#1601;&#1581;&#1575;&#1578; &#1604;&#1605;&#1607;&#1575;&#1580;&#1605;&#1577; &#1579;&#1594;&#1585;&#1575;&#1578; XSS &#1575;&#1608; &#1578;&#1582;&#1591;&#1610; &#1575;&#1604;&#1581;&#1605;&#1575;&#1610;&#1577; &#1575;&#1604;&#1605;&#1578;&#1593;&#1604;&#1602;&#1577; &#1576;&#1607;&#1575;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1602;&#1605; &#1576;&#1601;&#1581;&#1589; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580;&#1603; &#1608;&#1575;&#1604;&#1603;&#1588;&#1601; &#1593;&#1606; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1576;&#1573;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; &#1576;&#1585;&#1575;&#1605;&#1580; &#1605;&#1578;&#1582;&#1589;&#1589;&#1607; &#1601;&#1610; &#1584;&#1604;&#1603; &#1605;&#1579;&#1604; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593; &#1575;&#1604;&#1605;&#1588;&#1607;&#1608;&#1585; OWASP &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; &#1576;&#1600; </span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/OWASP_Zed_Attack_Proxy_Project">OWASP Zap</a></span><span class="c3">&nbsp;(&#1605;&#1601;&#1578;&#1608;&#1581; &#1575;&#1604;&#1605;&#1589;&#1583;&#1585; &#1608;&#1605;&#1580;&#1575;&#1606;&#1610; &#1571;&#1610;&#1590;&#1575;)</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1602;&#1605; &#1583;&#1575;&#1574;&#1605;&#1575; &#1576;&#1578;&#1601;&#1593;&#1610;&#1604; &#1582;&#1610;&#1575;&#1585; &#1575;&#1604;&#1600; </span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/HttpOnly">HTTPOnly</a></span><span class="c3">&nbsp;&#1593;&#1606;&#1583;&#1605;&#1575; &#1578;&#1587;&#1580;&#1604; &#1581;&#1575;&#1604;&#1577; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1575;&#1604;&#1600; Cookies. &#1607;&#1584;&#1575; &#1587;&#1610;&#1606;&#1576;&#1607; &#1575;&#1604;&#1605;&#1578;&#1589;&#1601;&#1581; &#1604;&#1603;&#1610; &#1604;&#1575;&#1610;&#1587;&#1605;&#1581; &#1604;&#1603;&#1608;&#1583; &#1575;&#1604;&#1587;&#1603;&#1585;&#1576;&#1578; &#1576;&#1602;&#1585;&#1575;&#1569;&#1577; &#1575;&#1604;&#1600;Cookies &#1608;&#1576;&#1575;&#1604;&#1578;&#1575;&#1604;&#1610; &#1605;&#1606;&#1593; &#1587;&#1585;&#1602;&#1578;&#1607;&#1575; &#1575;&#1608; &#1575;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604;&#1607;&#1575; &#1604;&#1578;&#1602;&#1606;&#1589; &#1588;&#1582;&#1589;&#1610;&#1577; &#1579;&#1575;&#1606;&#1610;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1610;&#1608;&#1580;&#1583; &#1582;&#1575;&#1589;&#1610;&#1577; &#1601;&#1610; &#1576;&#1585;&#1608;&#1578;&#1608;&#1603;&#1608;&#1604; HTTP &#1578;&#1587;&#1605;&#1609; &#1602;&#1575;&#1606;&#1608;&#1606; &#1575;&#1604;&#1605;&#1581;&#1578;&#1608;&#1609; &#1575;&#1604;&#1571;&#1605;&#1606;&#1610; </span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/Content_Security_Policy">CSP</a></span><span class="c3">&nbsp;&#1608;&#1575;&#1604;&#1584;&#1610; &#1610;&#1602;&#1608;&#1605; &#1576;&#1578;&#1582;&#1589;&#1610;&#1589; &#1575;&#1610; &#1605;&#1606; &#1575;&#1604;&#1580;&#1586;&#1575;&#1569; &#1575;&#1604;&#1605;&#1587;&#1605;&#1608;&#1581; &#1601;&#1610;&#1607;&#1575; &#1604;&#1605;&#1578;&#1589;&#1601;&#1581; &#1575;&#1606; &#1610;&#1602;&#1608;&#1605; &#1576;&#1578;&#1606;&#1601;&#1610;&#1584; &#1575;&#1608;&#1575;&#1605;&#1585; &#1603;&#1608;&#1583; &#1575;&#1604;&#1587;&#1603;&#1585;&#1576;&#1578; &#1601;&#1610; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577;. (&#1610;&#1578;&#1587;&#1582;&#1583;&#1605; &#1591;&#1585;&#1610;&#1602;&#1577; &#1575;&#1604;&#1602;&#1608;&#1575;&#1574;&#1605; &#1575;&#1604;&#1576;&#1610;&#1590;&#1575;&#1569; &#1601;&#1610; &#1584;&#1604;&#1603;!)</span></p><p class="c0 c2"><span class="c3"></span></p><p class="c0"><span class="c3">&#1601;&#1610; &#1575;&#1604;&#1606;&#1607;&#1575;&#1610;&#1577; &#1604;&#1605;&#1584;&#1575; &#1604;&#1575; &#1578;&#1602;&#1608;&#1605; &#1576;&#1578;&#1606;&#1589;&#1610;&#1576; &#1580;&#1583;&#1575;&#1585; &#1581;&#1605;&#1575;&#1610;&#1577; &#1606;&#1575;&#1585;&#1610; &#1605;&#1578;&#1582;&#1589;&#1589; &#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1608;&#1610;&#1576; WAF. &#1607;&#1584;&#1575; &#1587;&#1610;&#1603;&#1608;&#1606; &#1576;&#1605;&#1579;&#1575;&#1576;&#1577; &#1591;&#1576;&#1602;&#1577; &#1581;&#1605;&#1575;&#1610;&#1577; &#1575;&#1590;&#1575;&#1601;&#1610;&#1577; &#1578;&#1581;&#1605;&#1610; &#1605;&#1606; &#1573;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1579;&#1594;&#1585;&#1575;&#1578; XSS &#1601;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580;&#1603;. &#1610;&#1608;&#1580;&#1583; &#1575;&#1604;&#1593;&#1583;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1605;&#1578;&#1582;&#1589;&#1589;&#1577; &#1601;&#1610; &#1584;&#1604;&#1603; &#1576;&#1605;&#1575; &#1601;&#1610;&#1607;&#1605; </span><span class="c4 c3"><a class="c6" href="https://www.modsecurity.org/">mod Security</a></span><span class="c3">. &#1607;&#1584;&#1607; &#1575;&#1604;&#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1610;&#1580;&#1576; &#1571;&#1606; &#1578;&#1587;&#1578;&#1582;&#1583;&#1605; &#1603;&#1581;&#1604;&#1602;&#1577; &#1575;&#1590;&#1575;&#1601;&#1610;&#1577; &#1601;&#1602;&#1591; &#1608;&#1604;&#1575; &#1610;&#1580;&#1576; &#1575;&#1604;&#1573;&#1593;&#1578;&#1605;&#1575;&#1583; &#1593;&#1604;&#1610;&#1607;&#1575; &#1573;&#1584; &#1575;&#1606;&#1607; &#1610;&#1578;&#1605; &#1573;&#1587;&#1578;&#1603;&#1588;&#1575;&#1601; &#1591;&#1585;&#1602; &#1604;&#1578;&#1582;&#1591;&#1610;&#1607;&#1575; &#1583;&#1575;&#1574;&#1605;&#1575;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c1">&#1571;&#1610;&#1606; &#1571;&#1580;&#1583; &#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; &#1571;&#1603;&#1579;&#1585; &#1593;&#1606; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1567;</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1588;&#1585;&#1581;&#1606;&#1575; &#1606;&#1608;&#1593;&#1610;&#1606; &#1601;&#1602;&#1591; &#1605;&#1606; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1604;&#1603;&#1606;&#1607;&#1575; &#1604;&#1610;&#1587;&#1578; &#1575;&#1604;&#1608;&#1581;&#1610;&#1583;&#1577; &#1591;&#1576;&#1593;&#1575;! &#1607;&#1606;&#1575;&#1603; &#1575;&#1606;&#1608;&#1575;&#1593; &#1571;&#1582;&#1585;&#1609;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1605;&#1588;&#1585;&#1608;&#1593; &#1575;&#1605;&#1606; &#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1608;&#1610;&#1576; &#1575;&#1604;&#1605;&#1601;&#1578;&#1608;&#1581; &nbsp;</span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/Main_Page">Open Web Application Security Project (OWASP)</a></span><span class="c3">&nbsp; &#1607;&#1608; &#1605;&#1585;&#1580;&#1593; &#1605;&#1605;&#1578;&#1575;&#1586; &#1604;&#1580;&#1605;&#1610;&#1593; &#1605;&#1608;&#1575;&#1590;&#1610;&#1593; &#1575;&#1604;&#1571;&#1605;&#1606; &#1575;&#1604;&#1578;&#1610; &#1578;&#1578;&#1593;&#1604;&#1602; &#1576;&#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1608;&#1610;&#1576;. &#1602;&#1605; &#1576;&#1586;&#1610;&#1575;&#1585;&#1577; </span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)">&#1589;&#1601;&#1581;&#1577; &#1575;&#1604;&#1608;&#1610;&#1603;&#1610; &#1575;&#1604;&#1582;&#1575;&#1589;&#1577; &#1576;&#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1575;&#1604;&#1578;&#1610; &#1588;&#1585;&#1581;&#1606;&#1575;&#1607;&#1575; &#1607;&#1606;&#1575;</a></span><span class="c3">. &#1575;&#1608; </span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet">&#1589;&#1601;&#1581;&#1577; &#1603;&#1610;&#1601; &#1578;&#1581;&#1605;&#1610; &#1606;&#1601;&#1587;&#1603; &#1605;&#1606; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS</a></span><span class="c3">&nbsp;&#1575;&#1604;&#1605;&#1608;&#1580;&#1608;&#1583;&#1577; &#1593;&#1604;&#1609; &#1606;&#1601;&#1587; &#1575;&#1604;&#1605;&#1608;&#1602;&#1593;. &#1608;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; &#1571;&#1603;&#1579;&#1585; &#1581;&#1608;&#1604; &#1571;&#1582;&#1591;&#1585; 10 &#1607;&#1580;&#1605;&#1575;&#1578; &#1593;&#1604;&#1609; &#1576;&#1585;&#1575;&#1605;&#1580; &#1575;&#1604;&#1608;&#1610;&#1576; &#1602;&#1605; &#1576;&#1586;&#1610;&#1575;&#1585;&#1577; &#1589;&#1601;&#1581;&#1577; </span><span class="c4 c3"><a class="c6" href="https://www.owasp.org/index.php/Top_10_2013-Top_10">OWASP Top 10</a></span><span class="c3">.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1588;&#1603;&#1585;&#1575; &#1593;&#1604;&#1609; &#1602;&#1585;&#1575;&#1569;&#1578;&#1603;&#1605;. &#1578;&#1605; &#1578;&#1585;&#1580;&#1605;&#1577; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1575;&#1604;&#1571;&#1589;&#1604;&#1610;&#1577; &#1605;&#1606; </span><span class="c4 c3"><a class="c6" href="http://scriptalert1.com/index.html">&#1607;&#1606;&#1575;</a></span><span class="c3">&nbsp;- &#1603;&#1578;&#1576;&#1607;&#1575;: </span><span class="c4 c3"><a class="c6" href="http://www.dewhurstsecurity.com/">Ryan Dewhurst</a></span><span class="c3">&nbsp;&#1608; </span><span class="c3 c4"><a class="c6" href="http://www.tmacuk.co.uk/">Thomas MacKenzie</a></span></p><p class="c0"><span class="c3">&#1608;&#1602;&#1575;&#1605; &#1576;&#1575;&#1604;&#1578;&#1585;&#1580;&#1605;&#1577; </span><span class="c4 c3"><a class="c6" href="https://twitter.com/i4AK">&#1593;&#1576;&#1583;&#1575;&#1604;&#1603;&#1585;&#1610;&#1605; &#1575;&#1604;&#1586;&#1610;&#1583;&#1575;&#1606;&#1610;</a></span><span class="c3">.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">---</span></p><p class="c0"><span class="c3">&#1575;&#1604;&#1607;&#1583;&#1601; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1607;&#1608; &#1575;&#1604;&#1576;&#1587;&#1575;&#1591;&#1577; &#1601;&#1610; &#1578;&#1602;&#1583;&#1610;&#1605; &#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; &#1581;&#1608;&#1604; &#1579;&#1594;&#1585;&#1575;&#1578; &#1575;&#1604;&#1600; XSS &#1576;&#1573;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; &#1604;&#1594;&#1577; &#1576;&#1587;&#1610;&#1591;&#1577; &#1608; &#1583;&#1602;&#1610;&#1602;&#1577;.</span></p><p class="c2 c0"><span class="c3"></span></p><p class="c0"><span class="c3">&#1578;&#1589;&#1605;&#1610;&#1605; &#1607;&#1584;&#1607; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1605;&#1615;&#1604;&#1607;&#1605; &#1605;&#1606; http://justinjackson.ca/words.html</span></p><p class="c0"><span class="c3">---</span></p><p>Thanks to Abdulkarim Zidani for this translation. <a href="index.html">English version here</a>.</p></body></html>
